-- +goose Up
-- +goose StatementBegin
INSERT INTO events (id, name, subject, class, status) VALUES
                                                          (gen_random_uuid(), 'Олимпиадная математика (25.10.2026 - 31.10.26)', 'Математика', 9, 2),
                                                          (gen_random_uuid(), 'Олимпиадная физика (25.10.2026 - 31.10.26)', 'Физика', 9, 2),
                                                          (gen_random_uuid(), 'Олимпиадная химия (25.10.2026 - 31.10.26)', 'Химия', 9, 2),
                                                          (gen_random_uuid(), 'Олимпиадная биология (25.10.2026 - 31.10.26)', 'Биология', 10, 2),
                                                          (gen_random_uuid(), 'Олимпиадная информатика (профиль «Программирование») (25.10.2026 - 31.10.26)', 'Информатика', 9, 2),
                                                          (gen_random_uuid(), 'Олимпиадная экономика (25.10.2026 - 31.10.26)', 'Экономика', 11, 2);
-- +goose StatementEnd

-- +goose Down
-- +goose StatementBegin
DELETE FROM events
WHERE name IN (
               'Олимпиадная математика',
               'Олимпиадная физика',
               'Олимпиадная химия',
               'Олимпиадная биология',
               'Олимпиадная информатика (профиль «Программирование»)',
               'Олимпиадная экономика'
    );
-- +goose StatementEnd